0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (2.39 0 0);
    }

    heatedSurface
    {
        type            noSlip;
    }

    atmosphere
    {
        type            zeroGradient;
    }
	
    symmetryVer
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
	
    symmetryHor
    {
        type            cyclicAMI;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
