0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
|*---------------------------------------------------------------------------*|
|* OpenFOAM for Windows 18.10 (v1)                                           *|
|* Built by CFD Support, www.cfdsupport.com (based on Symscape).             *|
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    heatedSurface
    {
        type            omegaWallFunction;
        value           $internalField;
    }

    atmosphere
    {
        type            zeroGradient;
    }
	
    symmetryVer
    {
        type            cyclicAMI;
        value           $internalField;
    }
	
    symmetryHor
    {
        type            cyclicAMI;
        value           $internalField;
    }
}

// ************************************************************************* //
