0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    heatedSurface
    {
        type            fixedFluxPressure;
        value           $internalField;
    }

    atmosphere
    {
        type            fixedValue;
        value           $internalField;
    }
	
    symmetryVer
    {
        type            cyclicAMI;
        value           $internalField;
    }
	
    symmetryHor
    {
        type            cyclicAMI;
        value           $internalField;
    }
}

// ************************************************************************* //
